<script lang="ts" setup>
const news = [
    {
        image: '/images/test-image',
        title: 'Какая пицца с доставкой в Волгограде называется ЛУЧШЕЙ?',
        description:
            'Круглосуточная доставка пиццы Рустерс! Заказывай в любой день в любое время! Время доставки на указанный адрес может превышать 60 минут и озвучивается оператором при подтверждении заказа.',
        badge: '',
        link: '#',
        date: '01/08/2024',
    },
    {
        image: '/images/test-image-2',
        title: 'Утоли ночной голод с пиццей Рустерс!',
        description:
            'Круглосуточная доставка пиццы Рустерс! Заказывай в любой день в любое время! Время доставки на указанный адрес может превышать 60 минут и озвучивается оператором при подтверждении заказа.',
        badge: '',
        link: '#',
        date: '01/08/2024',
    },
    {
        image: '/images/test-image-3',
        title: 'Новинки с фирменным соусом барбекю',
        description:
            'Круглосуточная доставка пиццы Рустерс! Заказывай в любой день в любое время! Время доставки на указанный адрес может превышать 60 минут и озвучивается оператором при подтверждении заказа.',
        badge: '',
        link: '#',
        date: '01/08/2024',
    },
    {
        image: '/images/test-image-4',
        title: 'Празднуйте день рождения вместе с Рустерс!',
        description:
            'Круглосуточная доставка пиццы Рустерс! Заказывай в любой день в любое время! Время доставки на указанный адрес может превышать 60 минут и озвучивается оператором при подтверждении заказа.',
        badge: '',
        link: '#',
        date: '01/08/2024',
    },
    {
        image: '/images/test-image-2',
        title: 'Любители сыра, это для вас!',
        description:
            'Круглосуточная доставка пиццы Рустерс! Заказывай в любой день в любое время! Время доставки на указанный адрес может превышать 60 минут и озвучивается оператором при подтверждении заказа.',
        badge: '',
        link: '#',
        date: '01/08/2024',
    },
];
</script>
<template>
    <div class="container">
        <h1 class="h1">Новости</h1>
        <div class="news__grid">
            <NewsCard v-for="newsItem in news" :newsItem="newsItem" />
        </div>
    </div>
</template>
